;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION = logiciel de correction HL
ID1022 = ensemble de solutions
ID1023 = Veuillez sélectionner:
ID1007 = Enregistrer un autre en tant que
ID1017 = supprimer
ID1084 = importation
ID1085 = exportation

ID1075 = En-tête correct
ID1024 = paramètres de base
ID1025 = plage de taux (mm):
ID1026 = plage de marquage (mm):
ID1072 = système de coordonnées
ID1077 = angle rotatif
ID1079 = x décalage (mm)
ID1080 = y offset (mm)
ID1119 = miroir de vibration 1 = x
ID1120 = miroir de vibration 2 = x
ID1116 = revers
ID1117 = revers

ID1030 = correction de la grille et du niveau (double cliquez pour faire apparaître la fenêtre de calcul automatique après avoir sélectionné le rapport zoom)
ID1009 = niveau d'ajout
ID1010 = supprimer le niveau
ID1012 = effet global multi-niveaux
ID1031 = Retour au niveau des mots:
ID1018 = graphique de texte de marque de niveau maximum

ID1053 = correction du guang rouge
ID1043 = activer
ID1054 = Ratio d'astabilité x:
ID1055 = Y Zoom Ratio:
ID1056 = x déplacement (mm):
ID1057 = déviation y (mm):

ID1058 = focus
ID1065 = méthode de mise au point
ID1059 = type de mise au point dynamique
ID1060 = mode de contrôle
ID1061 = espacement d'un arbre (mm)
ID1082 = fangtou à la hauteur du plan de travail (mm)
ID1063 = valeur financière (um)
ID1062 = coefficient de compensation de mise au point dynamique

ID1011 = test f7
ID1037 = stop
ID1014 = paramètre >>

ID1109 = type correct
ID1099 = correction ordinaire
ID1100 = Correction de précision élevée 1 [scanner]
ID1101 = correction de précision élevée [Importer des données de coordonnées réelles]
ID1110 = instructions de correction de haute précision: 1, choisissez d'abord la correction normale pour la correction conventionnelle, effectuez des ajustements préliminaires au système de coordonnées, à la correction de la lumière rouge, à la taille de la boîte et à la déformation. 2, sélectionnez la correction de haute précision pour générer des points de grille. 3, après avoir obtenu les données avec différents outils et les avoir traitées, importez les données.
ID1114 = importation directe de données corrigées de haute précision

ID1089 = correction de la précision élevée
ID1086 = générer un point de grille
ID1111 = première étape: générer un point de grille.
ID1112 = étape 2: introduire les données de coordonnées réelles mesurées par le scanner ou la mesure à deux dimensions.
ID1113 = Étape 3: Créez une table de correction de prévision élevée et confirmez la sortie de conservation.

ID1096 = mise à l'échelle
ID1027 = plage de marquage à haute provision (mm)
ID1097 = bosse
ID1028 = Test de la taille de la boîte (mm):
ID1091 = importer des données après le traitement du scanner
ID1087 = Importer des données
ID1016 = créer un tableau de correction de prévision élevé
ID1139 = générer une table de correction
ID1 = ok
ID2 = annuler
ID1142 = contrôle de marquage

[CALISET_DLG_167]
CAPTION = Importation de données à haute provision
ID1114 = fichier de coordonnées x obtenu par la deuxième dimension:
ID1115 = fichier de coordonnées y obtenu par la deuxième dimension:
ID1 = ok
ID2 = annuler

[CALISET_DLG_159]
CAPTION  = Sauve de sauvegarde
ID1036 = Le schéma de correction est stocké séparément:
ID1 = ok
ID2 = annuler

[CALISET_DLG_131]
CAPTION = paramètre de marquage
ID1032 = nombre de temps de marquage:
ID1033 = vitesse de marquage (mm / s)
ID1035 = puissance (%)
ID1034 = q fréquence (kHz)
ID1036 = q temps de libération (US)
ID1037 = latence du turbide laser (US)
ID1 = ok
ID2 = annuler

[CALISET_DLG_160]
CAPTION = Définition de l'information d'étiquetage de l'étiquette
ID1093 = nombre de lignes
ID1094 = numéro de colonne
ID1116 = définir uniquement le nombre de rangs, ne pas marquer
ID1 = marquage
ID2 = annuler
ID1099 = points
ID1100 = croix
ID1101 = cercle

[CALISET_DLG_164]
CAPTION  = Sélectionner la carte de contrôle
ID1098 = Veuillez sélectionner une carte de travail:
ID1 = ok
ID2 = annuler


[CALISET_STRINGTABLE]
ID0 = taille de boîte (mm)
ID1 = ratio zoom%%
ID2 = y zoom ratio%%
ID3 = x cahoteux
ID4 = y bosse
ID5 = x trapézoïdal
ID6 = y trapézoïdal
ID7 = x parallèle
ID8 = y parallèle
ID9 = x proportion positive%%
ID10 = x rapport négatif%%
ID11 = y proportion positive%%
ID12 = y proportion négative%%
ID13 = paramètre \ niveau
ID14 = courant (a)
ID15 = puissance (%)
ID16 = courant (%)
ID17 = largeur d'impulsion laser (NS)
ID18 = mode laser
ID999 = a déjà un logiciel de marquage ou un logiciel de correction est en cours d'exécution, veuillez le fermer en premier!
ID1000 = perdu ou dommage au fichier d'analyse comparative, veuillez confirmer si le logiciel est normal!
ID1001 = L'initialisation de la carte de contrôle de marquage a échoué!
ID1002 = Les paramètres du système de carte de contrôle d'étiquette ont échoué!
ID1003 = Veuillez sélectionner le niveau de correction que vous souhaitez tester en premier!
ID1004 = L'opération a échoué, veuillez l'essayer plus tard!
ID1005 = Y a-t-il un nom de schéma qui a déjà existé?
ID1006 = La portée de la correction ne peut pas être 0!
ID1007 = La portée du marquage ne peut pas être 0!
ID1008 = Le coefficient proportionnel de la portée de la correction et la portée du marquage est incorrect.
ID1011 = Veuillez sélectionner le niveau pour supprimer le niveau
ID1012 = Veuillez garder au moins une correction de premier niveau!
ID1013 = erreur de fichier!
ID1014 = Définissez les données de correction sur l'échec de la carte, veuillez l'essayer plus tard!
ID1015 = Ce schéma de configuration de correction est incompatible avec la version logicielle actuelle. Est-ce la lecture forcée?
ID1016 = la taille de la boîte ne peut pas dépasser la plage de marquage!
ID1017 = la taille de la boîte ne peut pas dépasser la taille du niveau précédent!
ID1018 = Les paramètres de correction actuels ont été modifiés, est-il stocké?
ID1019 = le fichier de lecture a échoué!
ID1020 = confirmer la suppression du schéma actuel?
ID1021 = Les chiens logiciels ne sont pas détectés!
ID1022 = Les chiens logiciels sont détectés, mais pas les chiens logiciels légaux!
ID1023 = Il y a plus d'un logiciel juridique inséré!
ID1024 = convertir le chien initial en fonctionnement d'un chien a échoué!
ID1025 = "L'autorisation actuelle du logiciel a expiré et vous devez contacter le personnel du service client pour réappliquer le patch de licence avec (ID de chien =% S, code de vérification =% s)
ID1026 = "d160"
ID1027 = "d480"
ID1028 = "CO2 améliorer"
ID1029 = "Tradition CO2"
ID1030 = "lancement d'échec"
ID1031 = la taille de la boîte ne peut pas être plus petite que le niveau suivant!
ID1032 = au-delà de la zone de correction efficace
ID1033 = "foyer"
ID1034 = "Coking dynamique 3D"
ID1035 = "Focus de dos ordinaire"
ID1036 = "Le mode de contrôle laser simple doit être plus petit que la plage de marquage% dmm" "
ID1037 = "Obtenez l'ID de chien qui est stocké dans l'échec de la carte, veuillez vérifier si la carte est forcément liée"
ID1038 = "Import Fail"
ID1039 = "Succès d'importation"
ID1040 = "Exportation a échoué"
ID1041 = "Succès d'exportation"
ID1042 = "Opération FAIL"
ID1043 = "Les données de fichier ne correspondent pas"
ID1044 = "focus 3d" après "
ID1045 = "Le chemin du fichier de coordonnées x est vide!"
ID1046 = "Le chemin du fichier de coordonnées y est vide!"
ID1047 = "Le chien sur la carte est incompatible avec le numéro de chien crypté"
ID1048 = "Le numéro de carte sur la carte est vide ou la longueur n'est pas correcte" "

;---------------------------------End: EMCC\Caliset-----------------------------------------

[error]
1=Carte non initialisée ou carte introuvable !
2 = Échec de la réinitialisation!
3 = La version carte n’est pas correcte !
4 = Alarme!
6=Échec de l’exécution !
7=Le statut ne correspond pas !
16=Commande expirée !
17=Commande perdue !
18=Appel d’interface asynchrone !
19=Interface occupée par un autre programme!
20 = Saturation de l’axe Z ou corruption de fichier de correction!
21=Incompatibilité des paramètres!
23=Échec de l’allocation de mémoire !
100 = Utilisation hors ligne!
101=Commande abandonnée !
1001=Port 1
1002=Port 2
1003=Port 3
1004=Port 4
1005=Port 5
1006=Port 6
1007=Port 7
1008 = Entrée laser non prête
1009 = Prêt pour l’entrée laser

[4]
1 = Surchauffe laser, veuillez couper l’alimentation!
2 = Laser anti-alarme élevée, veuillez éteindre l’alimentation!
3 = Laser MO anormal, veuillez couper l’alimentation!
4 = Le couvercle laser est ouvert, veuillez éteindre l’alimentation et installer le couvercle laser!
5 = La porte de sécurité est ouverte, veuillez la fermer!
6 = L’obturateur est fermé anormalement, veuillez éteindre l’alimentation et vérifier l’obturateur!
7 = L’obturateur n’est pas ouvert anormalement, veuillez éteindre l’alimentation et vérifier l’obturateur!
8 = La porte de sécurité est ouverte, le marquage est suspendu, veuillez fermer la porte de sécurité pour continuer le marquage!
9 = Barrière de sécurité ouverte, marquage avorté !
10 = Alarme du système laser, veuillez éteindre l’alimentation!
11 = Tension d’alimentation laser hors de portée, veuillez éteindre l’alimentation!
12 = Alarme de surtension de l’alimentation laser, veuillez éteindre l’alimentation et vérifier la puissance laser!
13 = Alarme de sous-tension de l’alimentation laser, veuillez éteindre l’alimentation et vérifier l’alimentation laser!
14 = alarme de surchauffe laser SPI, veuillez couper l’alimentation!
15 = alarme de surintensité de l’amplificateur prêt pour le laser SPI, veuillez éteindre l’alimentation!
16 = Alarme de surintensité de l’amplificateur de puissance laser SPI, veuillez éteindre l’alimentation!
17 = Alarme laser de collimation laser SPI, veuillez éteindre l’alimentation!
18 = Alarme de rétention laser SPI, veuillez éteindre l’alimentation!
19 = Alarme d’alimentation laser SPI, veuillez éteindre l’alimentation!
20 = Alarme laser inconnue, veuillez éteindre l’alimentation!
21 = Alarme de surintensité de puissance laser, veuillez éteindre l’alimentation!
22 = Alarme de surtension de puissance laser, veuillez éteindre l’alimentation!
23 = Alarme de surchauffe de puissance laser, veuillez éteindre l’alimentation et vérifier les conditions de dissipation de chaleur!
24 = L’alimentation laser n’est pas allumée, veuillez vérifier l’alimentation.
30= Une limite négative est rencontrée pendant le mouvement, le marquage est avorté!
31= Lorsqu’une limite positive est rencontrée pendant le mouvement, le marquage est abandonné !
32= Impulsion du moteur hors de portée
33= Galvanomètre DA hors de portée!
34= Plate-forme X-axis Super Positive Limit!
35= Limite de dépassement de négatif de l’axe X de la plate-forme!
36 = Limite super positive de l’axe Y de la plate-forme!
37 = Limite de dépassement de l’axe Y de la plate-forme!
38 = La tête carrée du galvanomètre est alimentée anormalement, veuillez éteindre l’alimentation et vérifier!
54=Veuillez passer au tableau de correction 512!
55=Veuillez passer au tableau de correction 128!
100 = Le protecteur mobile est valide et ouvert !

110 = Atteignez une limite négative!
111 = atteindre une limite positive!
112 = Frappez l’origine en mouvement!
500 = Galvanomètre en échauffement, veuillez réessayer plus tard!

[door]
1=La porte de sécurité est ouverte, veuillez fermer la porte de sécurité!
2=La porte de sécurité est ouverte, le marquage est en pause, veuillez fermer la porte de sécurité pour continuer le marquage!
3 = La porte de sécurité est ouverte, le marquage est abandonné!
4 = La porte de sécurité est fermée, vous pouvez continuer à marquer!
5=La porte de sécurité est fermée et l’état est normal!
6=Une limite négative est rencontrée pendant l’exercice, le marquage est avorté!
7 = La limite positive est rencontrée pendant le mouvement, et le marquage est abandonné ! 
[usb]
1=Carte EMCC déjà connectée
2=La carte EMCC a été déconnectée

[4101]
3=Informations sur la fonction et la version de la carte DA 1
4 = Informations sur la date de version de la carte DA 1
5 = Temps écoulé de la carte DA 1
7 = nombre de trames d’erreur pour la carte DA 1
9 = Compte à rebours de la carte DA 1 jusqu’au temps d’erreur du 4e bit
11 = carte DA 1 temps de compte à rebours pour l’erreur 3rd bit
13 = carte DA 1 compte à rebours le temps de l’erreur 2nd bit
15 = Heure de l’erreur de dernier bit sur la carte DA 1

[4102]
4 = Nombre de trames hors code de la carte DA 1
6 = carte DA 1 compte à rebours le temps de la 4ème miss
8 = DA carte 1 compte à rebours l’heure du 3ème code manqué
10 = carte DA 1 compte à rebours l’heure du deuxième code manquant
12 = carte DA 1 dernière fois manquée
14 = carte DA 1 informations d’alarme galvanomètre
15 = carte DA 1 alarme galvanomètre hors laser activer

[4103]
3 = Informations sur la fonction et la version de la carte DA 2
4=Informations sur la date de version de la carte DA 2
5 = Temps écoulé de la carte DA 2
7 = Nombre de trames d’erreur pour la carte DA 2
9 = carte DA 2 temps de compte à rebours pour l’erreur 4th bit
11 = carte DA 2 temps de compte à rebours pour l’erreur 3rd bit
13 = carte DA 2 compte à rebours le temps de la deuxième erreur de bit
15 = heure de l’erreur du dernier bit sur la carte DA 2

[4104]
4 = le nombre de trames hors code de la carte DA 2
6 = DA card 2 compte à rebours le temps de la 4ème miss
8 = DA carte 2 compte à rebours le temps de la troisième miss
10 = carte DA 2 avant-dernier temps de perte
12 = l’heure à laquelle la carte DA 2 a été manquée pour la dernière fois
14 = carte DA 2 informations d’alarme galvanomètre
15 = carte DA 2 galvanomètre alarme hors laser activer

[4105]
3=Fonction de la carte LASER et informations de version
4=Informations sur la date de version de la carte LASER
5 = TEMPS ÉCOULÉ DE LA CARTE LASER
7 = LE NOMBRE DE TRAMES D’ERREUR POUR LA CARTE LASER
9 = Temps de l’avant-dernière erreur de bit de la carte LASER
11 = Heure de l’avant-dernière erreur de bit de la carte LASER
13 = Temps de compte à rebours jusqu’à l’erreur 2nd bit de la carte LASER
15 = Heure de l’erreur du dernier bit sur la carte LASER

[4106]
4 = LE NOMBRE D’IMAGES MANQUÉES DE LA CARTE LASER
6 = Le temps où la carte LASER perd son code pour le 4ème compte à rebours
8 = Le temps où la carte LASER perd le code pour le 3ème compte à rebours
10 = Le temps où la carte LASER perd le code pour l’avant-dernière fois
12 = dernier code manqué de la carte LASER
14=Message d’alarme du galvanomètre LASER
15 = Carte LASER alarme laser désactivée laser activer

[4107]
3 = LASER carte laser courant ns forme d’onde
4 = carte LASER courant laser ps forme d’onde
5 = LASER carte laser courant fs forme d’onde
6 = Le laser de la carte LASER maintient actuellement l’alimentation

[4102Warning]
0 = D0: communication de données anormale de la carte DA 1
1 = D1: Carte DA 1 Scanner alarme système
2 = D2: Carte DA 1 Alarme de température du scanner
3 = D3: Carte DA 1 Scanner alarme basse vitesse
4=D4 : Non utilisé
5=D5 : Non utilisé
6=D6 : Non utilisé
7=D7 : Non utilisé
8=D8 : Non utilisé
9=D9 : Non utilisé
10=D10 : Non utilisé
11=D11 : Non utilisé
12=D12 : Non utilisé
13=D13 : Non utilisé
14=D14 : Non utilisé
15=D15 : Carte EMCC Communication de données anormale

[4104Warning]
0 = D0: communication de données anormale de la carte DA 2
1 = D1: Alarme du système du scanner de la carte DA 2
2 = D2: Carte DA 2 Scanner alarme de température
3 = D3: Alarme basse vitesse du scanner de carte DA 2
4=D4 : Non utilisé
5=D5 : Non utilisé
6=D6 : Non utilisé
7=D7 : Non utilisé
8=D8 : Non utilisé
9=D9 : Non utilisé
10=D10 : Non utilisé
11=D11 : Non utilisé
12=D12 : Non utilisé
13=D13 : Non utilisé
14=D14 : Non utilisé
15=D15 : Non utilisé

[4106Warning]
0 = D0: Communication de données de carte LASER anormale
1 = D1: Alarme de température laser
2 = D2: Alarme de puissance
3=D3 : Alarme système
4=D4 : Anti-alarme élevée
5=D5 : Le laser n’est pas prêt
6 = D6: Échec de l’allumage laser de la graine
7 = D7: Alarme de température laser de semence
8 = D8: alarme de surintensité MO
9 = D9: alarme de surintensité PA
10=D10 : Alarme collimateur
11=D11 : Maintien de l’alarme 5
12=D12 : Maintien de l’alarme 4
13=D13 : Maintien de l’alarme 3
14=D14 : Maintien de l’alarme 2
15=D15 : Maintien de l’alarme 1

[Refresh]
Interval = 500


